BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega644RFR2.PIC
        <edc:SFRDef edc:_addr="0x144" edc:access="nnnn----" edc:cname="TRX_CTRL_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PLL_TX_FLT" edc:desc="Enable PLL TX filter" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX_AUTO_CRC_ON" edc:desc="Enable Automatic CRC Calculation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQ_2_EXT_EN" edc:desc="Connect Frame Start IRQ to TC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PA_EXT_EN" edc:desc="External PA support enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x145" edc:access="----nnnn" edc:cname="PHY_TX_PWR" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX_PWR" edc:desc="Transmit Power Setting" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="3.5 dBm" edc:when="(field &amp; 0xF) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="3.3 dBm" edc:when="(field &amp; 0xF) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="2.8 dBm" edc:when="(field &amp; 0xF) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="2.3 dBm" edc:when="(field &amp; 0xF) == 3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_4" edc:desc="1.8 dBm" edc:when="(field &amp; 0xF) == 4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_5" edc:desc="1.2 dBm" edc:when="(field &amp; 0xF) == 5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_6" edc:desc="0.5 dBm" edc:when="(field &amp; 0xF) == 6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_7" edc:desc="-0.5 dBm" edc:when="(field &amp; 0xF) == 7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_8" edc:desc="-1.5 dBm" edc:when="(field &amp; 0xF) == 8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_9" edc:desc="-2.5 dBm" edc:when="(field &amp; 0xF) == 9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_10" edc:desc="-3.5 dBm" edc:when="(field &amp; 0xF) == 10"/>
                <edc:SFRFieldSemantic edc:cname="VAL_11" edc:desc="-4.5 dBm" edc:when="(field &amp; 0xF) == 11"/>
                <edc:SFRFieldSemantic edc:cname="VAL_12" edc:desc="-6.5 dBm" edc:when="(field &amp; 0xF) == 12"/>
                <edc:SFRFieldSemantic edc:cname="VAL_13" edc:desc="-8.5 dBm" edc:when="(field &amp; 0xF) == 13"/>
                <edc:SFRFieldSemantic edc:cname="VAL_14" edc:desc="-11.5 dBm" edc:when="(field &amp; 0xF) == 14"/>
                <edc:SFRFieldSemantic edc:cname="VAL_15" edc:desc="-16.5 dBm" edc:when="(field &amp; 0xF) == 15"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x146" edc:access="nnnnnnnn" edc:cname="PHY_RSSI" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSSI" edc:desc="Receiver Signal Strength Indicator" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="RSSI_MIN" edc:desc="Minimum RSSI value: P(RF) &lt; -90 dBm" edc:when="(field &amp; 0x1F) == 0"/>
                <edc:SFRFieldSemantic edc:cname="RSSI_MIN_PLUS_3dB" edc:desc="P(RF) = RSSI_BASE_VAL+3 · (RSSI-1) [dBm]" edc:when="(field &amp; 0x1F) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="..." edc:when="(field &amp; 0x1F) == 2"/>
                <edc:SFRFieldSemantic edc:cname="RSSI_MAX" edc:desc="Maximum RSSI value: P(RF) ≥ -10 dBm" edc:when="(field &amp; 0x1F) == 28"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="RND_VALUE" edc:desc="Random Value" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RX_CRC_VALID" edc:desc="Received Frame CRC Status" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="CRC_INVALID" edc:desc="CRC (FCS) not valid" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="CRC_VALID" edc:desc="CRC (FCS) valid" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x147" edc:access="nnnnnnnn" edc:cname="PHY_ED_LEVEL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ED_LEVEL" edc:desc="Energy Detection Level" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="ED_MIN" edc:desc="Minimum result of last ED measurement" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ED_MIN_PLUS_1dB" edc:desc="P(RF) = RSSI_BASE_VAL+ED [dBm]" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="..." edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ED_MAX" edc:desc="Maximum result of last ED measurement" edc:when="(field &amp; 0xFF) == 0x54"/>
                <edc:SFRFieldSemantic edc:cname="ED_RESET" edc:desc="Reset value" edc:when="(field &amp; 0xFF) == 0xFF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x148" edc:access="nnnnnnnn" edc:cname="PHY_CC_CCA" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="RX/TX Channel Selection" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="F_2405MHZ" edc:desc="2405 MHz" edc:when="(field &amp; 0x1F) == 11"/>
                <edc:SFRFieldSemantic edc:cname="F_2410MHZ" edc:desc="2410 MHz" edc:when="(field &amp; 0x1F) == 12"/>
                <edc:SFRFieldSemantic edc:cname="F_2415MHZ" edc:desc="2415 MHz" edc:when="(field &amp; 0x1F) == 13"/>
                <edc:SFRFieldSemantic edc:cname="F_2420MHZ" edc:desc="2420 MHz" edc:when="(field &amp; 0x1F) == 14"/>
                <edc:SFRFieldSemantic edc:cname="F_2425MHZ" edc:desc="2425 MHz" edc:when="(field &amp; 0x1F) == 15"/>
                <edc:SFRFieldSemantic edc:cname="F_2430MHZ" edc:desc="2430 MHz" edc:when="(field &amp; 0x1F) == 16"/>
                <edc:SFRFieldSemantic edc:cname="F_2435MHZ" edc:desc="2435 MHz" edc:when="(field &amp; 0x1F) == 17"/>
                <edc:SFRFieldSemantic edc:cname="F_2440MHZ" edc:desc="2440 MHz" edc:when="(field &amp; 0x1F) == 18"/>
                <edc:SFRFieldSemantic edc:cname="F_2445MHZ" edc:desc="2445 MHz" edc:when="(field &amp; 0x1F) == 19"/>
                <edc:SFRFieldSemantic edc:cname="F_2450MHZ" edc:desc="2450 MHz" edc:when="(field &amp; 0x1F) == 20"/>
                <edc:SFRFieldSemantic edc:cname="F_2455MHZ" edc:desc="2455 MHz" edc:when="(field &amp; 0x1F) == 21"/>
                <edc:SFRFieldSemantic edc:cname="F_2460MHZ" edc:desc="2460 MHz" edc:when="(field &amp; 0x1F) == 22"/>
                <edc:SFRFieldSemantic edc:cname="F_2465MHZ" edc:desc="2465 MHz" edc:when="(field &amp; 0x1F) == 23"/>
                <edc:SFRFieldSemantic edc:cname="F_2470MHZ" edc:desc="2470 MHz" edc:when="(field &amp; 0x1F) == 24"/>
                <edc:SFRFieldSemantic edc:cname="F_2475MHZ" edc:desc="2475 MHz" edc:when="(field &amp; 0x1F) == 25"/>
                <edc:SFRFieldSemantic edc:cname="F_2480MHZ" edc:desc="2480 MHz" edc:when="(field &amp; 0x1F) == 26"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CCA_MODE" edc:desc="Select CCA Measurement Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="CCA_CS_OR_ED" edc:desc="Mode 3a, Carrier sense OR energy above threshold" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="CCA_ED" edc:desc="Mode 1, Energy above threshold" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="CCA_CS" edc:desc="Mode 2, Carrier sense only" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="CCA_CS_AND_ED" edc:desc="Mode 3b, Carrier sense AND energy above threshold" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CCA_REQUEST" edc:desc="Manual CCA Measurement Request" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
